module.exports = [/*{
 title: 'true: 1st condition',
 code: 'տպել(արմատ(քառակուսի(5)))',
 output: '5'
 }*/
  {
    title: 'operations_sum_of_string_and_number',
    code: 'տպել(«Խնդրում եմ մուտքագրել Ձեր տարիքը։»)\nգրել(տարիք)\nեթե տարիք < 18\n    տպել(«Մուտքը միայն չափահասների համար է։»)\nայլապես եթե տարիք > 18 \n    տպել(«Դուք հաջողությամբ մուտք եք գործել։»)\nայլապես\n    տպել(«Դուք ստացել եք մասնակի հնարավորության մուտք։»)',
    inputs: [21],
    output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք հաջողությամբ մուտք եք գործել։'
  }
];