module.exports = [{
  group: 'restrictions',
  sources: [{
    title: 'variable',
    code: `տպել "Այս ծրագիրը թարգմանում է թիվը 10-ական համակարգից 16-ականի։"

տպել "Գրեք թիվը 10-ական համաակարգում՝"
մուտքագրել տաս

տասնվեցային = ""

մինչ տաս != 0
    մնաց = տաս % 16          
    տաս = (տաս - մնաց) / 16  
    եթե մնաց == 15
        մնաց = "F"
    եթե մնաց == 14
        մնաց = "E"
    եթե մնաց == 13
        մնաց = "D"
    եթե մնաց == 12
        մնաց = "C"
    եթե մնաց == 11
        մնաց = "B"
    եթե մնաց == 10
        մնաց = "A"
    տասնվեցային = մնաց + տասնվեցային

տպել "16-ական համակարգում նրա արժեքն է՝"
տպել տասնվեցային`,
    inputs: [617, 617],
    output: '617'
  }]
}];
