import type {Source} from './types.ts';

const sources: Source[] = [
  {
    group: 'intro',
    sources: [
      {
        title: 'language_about_language',
        code: 'արտածել(«Իմ անունը LinguaCode է, իսկ քո՞նը»)\nանուն = մուտքագրել()\nարտածել(«հաճելի է ծանոթանալ, » + անուն)',
        inputs: ['Մանե'],
        output: 'Իմ անունը LinguaCode է, իսկ քո՞նը\nհաճելի է ծանոթանալ, Մանե'
      },
      {
        title: 'language_features',
        code: '# սա օրինակ է, որտեղ հրամանները գրված են թե՛ մեծատառ և թե՛ փոքրատառ։\n\nարտածել("հրաման՝ ամբողջական փոքրատառ")\n\n# ելք "հրաման՝ ամբողջական մեծատառ"\n\nարտածել("հրաման՝ խառը տառերի չափսերով")\n\n\n# սա օրինակ է, որտեղ տեքստը գրված է տարբեր չակերտների և ապաթարցների միջև։\n\nարտածել(«1. Չակերտների օրինակ»)\n\nարտածել(\'2. ապաթարցների օրինակ\')\n\nարտածել("3. կրկնակ ապաթարցների օրինակ")',
        output:
          'հրաման՝ ամբողջական փոքրատառ\nհրաման՝ խառը տառերի չափսերով\n1. Չակերտների օրինակ\n2. ապաթարցների օրինակ\n3. կրկնակ ապաթարցների օրինակ'
      }
    ]
  },
  {
    group: 'output',
    sources: [
      {
        title: 'output_command_definition',
        code: 'արտածել(«Անահիտ»)',
        output: 'Անահիտ'
      },
      {
        title: 'language_features',
        code: 'արտածել(617)\nարտածել(617 * 2)',
        output: '617\n1234'
      }
    ]
  },
  {
    group: 'variables',
    sources: [
      {
        title: 'variables_declares_and_assigns',
        code: 'X = 617\nY = 2\nարտածել(X * Y)',
        output: '1234'
      },
      {
        title: 'variables_practical_use',
        code: 'a = 1\nb = 2\nc = a + b\nd = a + b + c\nարտածել(d)',
        output: '6'
      },
      {
        title: 'variables_multiple_uses',
        code: 'դրամ = 300\nարտածել(դրամ)\nդրամ = դրամ + 200\nարտածել(դրամ)\nդրամ = դրամ + 400\nարտածել(դրամ)\nդրամ = դրամ - 100\nարտածել(դրամ)',
        output: '300\n500\n900\n800'
      }
    ]
  },
  {
    group: 'input',
    sources: [
      {
        title: 'input_command_definition',
        code: 'արտածել("Բարև հարգելի օգտատեր, կներկայանա՞ք")\nանուն = մուտքագրել()\nարտածել("հաճելի է ծանոթանալ, " + անուն)',
        inputs: ['Մարինե'],
        output: 'Բարև հարգելի օգտատեր, կներկայանա՞ք\nհաճելի է ծանոթանալ, Մարինե'
      },
      {
        title: 'input_work_mechanism',
        code: 'արտածել("Խնդրում ենք մուտքագրել ձեր տվյալները՝")\nարտածել("Անունը՝")\nանուն = մուտքագրել()\nարտածել("Ազգանունը՝")\nազգանուն = մուտքագրել()\nարտածել("Հայրանունը՝")\nհայրանուն = մուտքագրել()\nարտածել("Բարև Ձեզ, " + անուն + " " + ազգանուն+ " " + հայրանուն)',
        inputs: ['Մարինե', 'Չամչյան', 'Ռաֆայելի'],
        output:
          'Խնդրում ենք մուտքագրել ձեր տվյալները՝\nԱնունը՝\nԱզգանունը՝\nՀայրանունը՝\nԲարև Ձեզ, Մարինե Չամչյան Ռաֆայելի'
      }
    ]
  },
  {
    group: 'operations',
    sources: [
      {
        title: 'operations_arithmetic_operators',
        code: 'X = մուտքագրել()\nY = մուտքագրել()\n\nարտածել(X * Y)\nարտածել(X + Y)\nարտածել(X - Y)\nարտածել(X / Y)',
        inputs: [2, 5],
        output: '10\n7\n-3\n0.4'
      },
      {
        title: 'operations_executing_priority',
        code: 'X = (1 + (2 - 3) - 4 + 5)\nարտածել(X)',
        output: '1'
      },
      {
        title: 'operations_numbers',
        code: 'X = 1 / (8 - 1) + 6 / 7  # 1\nարտածել(X)',
        output: '1'
      },
      {
        title: 'operations_sum_of_string_and_number',
        code: 'արտածել(«խնդրում ենք մուտքագրել ձեր ծննդյան տարեթիվը») \nտարեթիվ = մուտքագրել()\nտարիք = 2016 - տարեթիվ\nարտածել(«Ձեր տարիքը » + տարիք + « է»)',
        inputs: [1995],
        output: 'խնդրում ենք մուտքագրել ձեր ծննդյան տարեթիվը\nՁեր տարիքը 21 է'
      }
    ]
  },
  {
    group: 'conditions',
    sources: [
      {
        title: 'conditions_commands_if',
        code: 'արտածել(«Խնդրում եմ մուտքագրել Ձեր տարիքը։»)\nտարիք = մուտքագրել()\nեթե տարիք < 18\n    արտածել(«Մուտքը միայն չափահասների համար է։»)',
        inputs: [17],
        output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nՄուտքը միայն չափահասների համար է։'
      },
      {
        title: 'conditions_commands_if_else',
        code: 'արտածել(«Խնդրում եմ մուտքագրել Ձեր տարիքը։»)\nտարիք = մուտքագրել()\nեթե տարիք < 18\n    արտածել(«Մուտքը միայն չափահասների համար է։»)\nայլապես\n    արտածել(«Դուք հաջողությամբ մուտք եք գործել։»)',
        inputs: [21],
        output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք հաջողությամբ մուտք եք գործել։'
      },
      {
        title: 'operations_sum_of_string_and_number',
        code: 'արտածել(«Խնդրում եմ մուտքագրել Ձեր տարիքը։»)\nտարիք = մուտքագրել()\nեթե տարիք < 18\n    արտածել(«Մուտքը միայն չափահասների համար է։»)\nայլապես եթե տարիք > 18 \n    արտածել(«Դուք հաջողությամբ մուտք եք գործել։»)\nայլապես\n    արտածել(«Դուք ստացել եք մասնակի հնարավորության մուտք։»)',
        inputs: [21],
        output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք հաջողությամբ մուտք եք գործել։'
      }
    ]
  },
  {
    group: 'boolean',
    sources: [
      {
        title: 'boolean_types_boolean',
        code: 'արտածել(«Խնդրում եմ մուտքագրել Ձեր տարիքը։»)\nտարիք = մուտքագրել()\n\nպայման1 = տարիք < 18\nպայման2 = տարիք > 18\n\nեթե պայման1\n    արտածել(«Մուտքը միայն չափահասների համար է։»)\nայլապես եթե պայման2 \n    արտածել(«Դուք հաջողությամբ մուտք եք գործել։»)\nայլապես\n    արտածել(«Դուք ստացել եք մասնակի հնարավորության մուտք։»)',
        inputs: [18],
        output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք ստացել եք մասնակի հնարավորության մուտք։'
      },
      {
        title: 'boolean_operators_comparison',
        code: 'login_1 = «otanim617»\n\nարտածել(«Մուտքագրեք ձեր գաղտնանունը։»)\nlogin_2 = մուտքագրել()\nեթե login_1 == login_2\n    արտածել(«մուտքը հաջողված է»)\nայլապես\n    արտածել(«մուտքագրված գաղտնանունը սխալ է։»)',
        inputs: ['minato617'],
        output: 'Մուտքագրեք ձեր գաղտնանունը։\nմուտքագրված գաղտնանունը սխալ է։'
      },
      {
        title: 'boolean_operators_logical',
        code: 'email_1 = «otanim617@gmail.com»\npassword_1 = «pA22M0Rd»\n\nարտածել(«Մուտքագրեք էլ. հասցեն։»)\nemail_2 = մուտքագրել()\nարտածել(«Մուտքագրեք գաղտնաբառը։»)\npassword_2 = մուտքագրել()\n\nեթե email_1 == email_2 և password_1 == password_2\n    արտածել(«մուտքը հաջողված է։»)\nայլապես\n    արտածել(«մուտքագրված տվյալները սխալ են։»)',
        inputs: ['otanim617@gmail.com', 'pA22M0Rd'],
        output: 'Մուտքագրեք էլ. հասցեն։\nՄուտքագրեք գաղտնաբառը։\nմուտքը հաջողված է։'
      },
      {
        title: 'boolean_operators_executing_priority',
        code: 'արտածել(5 <= 1 և (3 == 2 կամ 1 < 7) կամ 9 != 9)',
        output: 'սխալ'
      }
    ]
  }
];

export default sources;
