module.exports = [{
  group: 'intro',
  sources: [{
    title: 'language_about_language',
    code: 'տպել «Իմ անունը LinguaCode է, իսկ քո՞նը»\nգրել անուն\nտպել «հաճելի է ծանոթանալ, » + անուն',
    inputs: ['Մանե'],
    output: 'Իմ անունը LinguaCode է, իսկ քո՞նը\nհաճելի է ծանոթանալ, Մանե'
  }, {
    title: 'language_features',
    code: '# սա օրինակ է, որտեղ հրամանները գրված են թե՛ մեծատառ և թե՛ փոքրատառ։\n\nտպել \"հրաման՝ ամբողջական փոքրատառ\"\n\n# ՏՊԵԼ \"հրաման՝ ամբողջական մեծատառ\"\n\nտՊԵլ \"հրաման՝ խառը տառերի չափսերով\"\n\n\n# սա օրինակ է, որտեղ տեքստը գրված է տարբեր չակերտների և ապաթարցների միջև։\n\nտպել «1. Չակերտների օրինակ»\n\nտպել \'2. ապաթարցների օրինակ\'\n\nտպել \"3. կրկնակ ապաթարցների օրինակ\"',
    output: 'հրաման՝ ամբողջական փոքրատառ\nհրաման՝ խառը տառերի չափսերով\n1. Չակերտների օրինակ\n2. ապաթարցների օրինակ\n3. կրկնակ ապաթարցների օրինակ'
  }]
}, {
  group: 'output',
  sources: [{
    title: 'output_command_definition',
    code: 'տպել «Անահիտ»',
    output: 'Անահիտ'
  }, {
    title: 'language_features',
    code: 'տպել 617\nտպել 617 * 2',
    output: '617\n1234'
  }]
}, {
  group: 'variables',
  sources: [{
    title: 'variables_declares_and_assigns',
    code: 'X = 617\nY = 2\nտպել X * Y',
    output: '1234'
  }, {
    title: 'variables_practical_use',
    code: 'a = 1\nb = 2\nc = a + b\nd = a + b + c\nտպել d',
    output: '6'
  }, {
    title: 'variables_multiple_uses',
    code: 'դրամ = 300\nտպել դրամ\nդրամ = դրամ + 200\nտպել դրամ\nդրամ = դրամ + 400\nտպել դրամ\nդրամ = դրամ - 100\nտպել դրամ',
    output: '300\n500\n900\n800'
  }]
}, {
  group: 'input',
  sources: [{
    title: 'input_command_definition',
    code: 'տպել \"Բարև հարգելի օգտատեր, կներկայանա՞ք\"\nգրել անուն\nտպել \"հաճելի է ծանոթանալ, \" + անուն',
    inputs: ['Մարինե'],
    output: 'Բարև հարգելի օգտատեր, կներկայանա՞ք\nհաճելի է ծանոթանալ, Մարինե'
  }, {
    title: 'input_work_mechanism',
    code: 'տպել \"Խնդրում ենք մուտքագրել ձեր տվյալները՝\"\nտպել \"Անունը՝\"\nգրել անուն\nտպել \"Ազգանունը՝\"\nգրել ազգանուն\nտպել \"Հայրանունը՝\"\nգրել հայրանուն\nտպել \"Բարև Ձեզ, \" + անուն + \" \" + ազգանուն+ \" \" + հայրանուն',
    inputs: ['Մարինե', 'Չամչյան', 'Ռաֆայելի'],
    output: 'Խնդրում ենք մուտքագրել ձեր տվյալները՝\nԱնունը՝\nԱզգանունը՝\nՀայրանունը՝\nԲարև Ձեզ, Մարինե Չամչյան Ռաֆայելի'
  }]
}, {
  group: 'operations',
  sources: [{
    title: 'operations_arithmetic_operators',
    code: 'գրել X\nգրել Y\n\nտպել X * Y\nտպել X + Y\nտպել X - Y\nտպել X / Y',
    inputs: [2, 5],
    output: '10\n7\n-3\n0.4'
  }, {
    title: 'operations_executing_priority',
    code: 'X = (1 + (2 - 3) - 4 + 5)\nտպել X',
    output: '1'
  }, {
    title: 'operations_numbers',
    code: 'X = 1 / (8 - 1) + 6 / 7  # 1\nտպել X',
    output: '1'
  }, {
    title: 'operations_sum_of_string_and_number',
    code: 'տպել «խնդրում ենք մուտքագրել ձեր ծննդյան տարեթիվը»\nգրել տարեթիվ\nտարիք = 2016 - տարեթիվ\nտպել «Ձեր տարիքը » + տարիք + « է»',
    inputs: [1995],
    output: 'խնդրում ենք մուտքագրել ձեր ծննդյան տարեթիվը\nՁեր տարիքը 21 է'
  }]
}, {
  group: 'conditions',
  sources: [{
    title: 'conditions_commands_if',
    code: 'տպել «Խնդրում եմ մուտքագրել Ձեր տարիքը։»\nգրել տարիք\nեթե տարիք < 18\n    տպել «Մուտքը միայն չափահասների համար է։»',
    inputs: [17],
    output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nՄուտքը միայն չափահասների համար է։'
  }, {
    title: 'conditions_commands_if_else',
    code: 'տպել «Խնդրում եմ մուտքագրել Ձեր տարիքը։»\nգրել տարիք\nեթե տարիք < 18\n    տպել «Մուտքը միայն չափահասների համար է։»\nայլապես\n    տպել «Դուք հաջողությամբ մուտք եք գործել։»',
    inputs: [21],
    output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք հաջողությամբ մուտք եք գործել։'
  }, {
    title: 'operations_sum_of_string_and_number',
    code: 'տպել «Խնդրում եմ մուտքագրել Ձեր տարիքը։»\nգրել տարիք\nեթե տարիք < 18\n    տպել «Մուտքը միայն չափահասների համար է։»\nայլապես եթե տարիք > 18 \n    տպել «Դուք հաջողությամբ մուտք եք գործել։»\nայլապես\n    տպել «Դուք ստացել եք մասնակի հնարավորության մուտք։»',
    inputs: [21],
    output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք հաջողությամբ մուտք եք գործել։'
  }]
}, {
  group: 'boolean',
  sources: [{
    title: 'boolean_types_boolean',
    code: 'տպել «Խնդրում եմ մուտքագրել Ձեր տարիքը։»\nգրել տարիք\n\nպայման1 = տարիք < 18\nպայման2 = տարիք > 18\n\nեթե պայման1\n    տպել «Մուտքը միայն չափահասների համար է։»\nայլապես եթե պայման2 \n    տպել «Դուք հաջողությամբ մուտք եք գործել։»\nայլապես\n    տպել «Դուք ստացել եք մասնակի հնարավորության մուտք։»',
    inputs: [18],
    output: 'Խնդրում եմ մուտքագրել Ձեր տարիքը։\nԴուք ստացել եք մասնակի հնարավորության մուտք։'
  }, {
    title: 'boolean_operators_comparison',
    code: 'login_1 = «otanim617»\n\nտպել «Մուտքագրեք ձեր գաղտնանունը։»\nգրել login_2\nեթե login_1 == login_2\n    տպել «մուտքը հաջողված է»\nայլապես\n    տպել «մուտքագրված գաղտնանունը սխալ է։»',
    inputs: ['minato617'],
    output: 'Մուտքագրեք ձեր գաղտնանունը։\nմուտքագրված գաղտնանունը սխալ է։'
  }, {
    title: 'boolean_operators_logical',
    code: 'email_1 = «otanim617@gmail.com»\npassword_1 = «pA22M0Rd»\n\nտպել «Մուտքագրեք էլ. հասցեն։»\nգրել email_2\nտպել «Մուտքագրեք գաղտնաբառը։»\nգրել password_2\n\nեթե email_1 == email_2 և password_1 == password_2\n    տպել «մուտքը հաջողված է։»\nայլապես\n    տպել «մուտքագրված տվյալները սխալ են։»',
    inputs: ['otanim617@gmail.com', 'pA22M0Rd'],
    output: 'Մուտքագրեք էլ. հասցեն։\nՄուտքագրեք գաղտնաբառը։\nմուտքը հաջողված է։'
  }, {
    title: 'boolean_operators_executing_priority',
    code: 'տպել 5 <= 1 և (3 == 2 կամ 1 < 7) կամ 9 != 9',
    output: 'սխալ'
  }]
}];